src_doc/InformationRegisters/РеестрМоихДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>РеестрМоихДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>БезОтвета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДобавленВручную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Истекает</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НазначенаЗадачаМне</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтправленаЗадачаОтМеня</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредставлениеДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Просрочен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЯвляюсьАвторомДокумента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЯвляюсьАвторомУтвержденияДокумента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЯвляюсьОтветственнымЗаДокумент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЯвляюсьПодписантомДокумента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаСортировки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПредприятия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДокументыПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_doc/InformationRegisters/РеестрМоихДокументов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Данные строк с учетом прав.
// 
// Параметры:
//  МассивДокументов - Массив из СправочникСсылка.ДокументыПредприятия
// 
// Возвращаемое значение:
//  Соответствие из Структура:
//   * Наименование - Строка
//   * ВидДокумента - СправочникСсылка.ВидыДокументов
//   * Проект - СправочникСсылка.Проекты
// 
Функция ДанныеСтрокСУчетомПрав(МассивДокументов) Экспорт
	
	ДанныеСтрокСУчетомПрав = Новый Соответствие;
	Если МассивДокументов.Количество() = 0 Тогда
		Возврат ДанныеСтрокСУчетомПрав;
	КонецЕсли;
	
	Для Каждого ДокументПредприятия Из МассивДокументов Цикл
		ДанныеСтрокиСУчетомПрав = Новый Структура;
		ДанныеСтрокиСУчетомПрав.Вставить("Наименование", "");
		ДанныеСтрокиСУчетомПрав.Вставить("ВидДокумента", Справочники.ВидыДокументов.ПустаяСсылка());
		ДанныеСтрокиСУчетомПрав.Вставить("Проект", Справочники.Проекты.ПустаяСсылка());
		ДанныеСтрокСУчетомПрав[ДокументПредприятия] = ДанныеСтрокиСУчетомПрав;
	КонецЦикла;
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеестрМоихДокументов.ДокументПредприятия КАК ДокументПредприятия,
		|	ПРЕДСТАВЛЕНИЕ(РеестрМоихДокументов.ДокументПредприятия) КАК Наименование,
		|	ЕСТЬNULL(ДокументыПредприятия.ВидДокумента, ЗНАЧЕНИЕ(Справочник.ВидыДокументов.ПустаяСсылка)) КАК ВидДокумента,
		|	ЕСТЬNULL(ДокументыПредприятия.Проект, ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)) КАК Проект
		|ИЗ
		|	РегистрСведений.РеестрМоихДокументов КАК РеестрМоихДокументов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДокументыПредприятия КАК ДокументыПредприятия
		|		ПО РеестрМоихДокументов.ДокументПредприятия = ДокументыПредприятия.Ссылка
		|ГДЕ
		|	РеестрМоихДокументов.Пользователь = &Пользователь
		|	И РеестрМоихДокументов.ДокументПредприятия В (&МассивДокументов)");
	
	Запрос.УстановитьПараметр("Пользователь", Пользователи.ТекущийПользователь());
	Запрос.УстановитьПараметр("МассивДокументов", МассивДокументов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДанныеСтрокиСУчетомПрав = ДанныеСтрокСУчетомПрав[ВыборкаДетальныеЗаписи.ДокументПредприятия];
		ДанныеСтрокиСУчетомПрав.Наименование = ВыборкаДетальныеЗаписи.Наименование;
		ДанныеСтрокиСУчетомПрав.ВидДокумента = ВыборкаДетальныеЗаписи.ВидДокумента;
		ДанныеСтрокиСУчетомПрав.Проект = ВыборкаДетальныеЗаписи.Проект;
	КонецЦикла;
	
	Возврат ДанныеСтрокСУчетомПрав;
	
КонецФункции

#КонецОбласти

#КонецЕсли
